{"list": ["<PAD>", " ", "!", "\"", "#", "$", "%", "&", "'", "(", ")", "*", "+", ",", "-", ".", "/", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", ":", ";", "<", "=", ">", "?", "@", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", "[", "\\", "]", "^", "_", "`", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "{", "}", "~", "\u00a2", "\u00a3", "\u00a5", "\u00a7", "\u00ab", "\u00ac", "\u00af", "\u00b0", "\u00b1", "\u00b2", "\u00b3", "\u00b5", "\u00b7", "\u00bb", "\u00bd", "\u00c0", "\u00c1", "\u00c4", "\u00c5", "\u00c6", "\u00c7", "\u00c9", "\u00ce", "\u00d1", "\u00d2", "\u00d3", "\u00d6", "\u00d7", "\u00d8", "\u00dc", "\u00dd", "\u00de", "\u00df", "\u00e0", "\u00e1", "\u00e2", "\u00e3", "\u00e4", "\u00e5", "\u00e6", "\u00e7", "\u00e8", "\u00e9", "\u00ea", "\u00eb", "\u00ec", "\u00ed", "\u00ee", "\u00ef", "\u00f0", "\u00f1", "\u00f2", "\u00f3", "\u00f4", "\u00f5", "\u00f6", "\u00f7", "\u00f8", "\u00f9", "\u00fa", "\u00fb", "\u00fc", "\u00fd", "\u00fe", "\u00ff", "\u0100", "\u0101", "\u0103", "\u0106", "\u0107", "\u010c", "\u010d", "\u0110", "\u0111", "\u0113", "\u0114", "\u0115", "\u011b", "\u011f", "\u0126", "\u0127", "\u012b", "\u012d", "\u0130", "\u0131", "\u0142", "\u0144", "\u014b", "\u014c", "\u014d", "\u0152", "\u0153", "\u0159", "\u015a", "\u015b", "\u015e", "\u015f", "\u0160", "\u0161", "\u016b", "\u0177", "\u017e", "\u01b7", "\u01b8", "\u01d4", "\u0219", "\u021a", "\u0222", "\u0250", "\u0251", "\u0259", "\u025b", "\u025f", "\u0263", "\u028e", "\u0294", "\u02b7", "\u02b9", "\u02bb", "\u02bc", "\u02be", "\u02bf", "\u02c8", "\u02d0", "\u0301", "\u0304", "\u0321", "\u0325", "\u0328", "\u0331", "\u0335", "\u033d", "\u0388", "\u0390", "\u0391", "\u0392", "\u0394", "\u0395", "\u0397", "\u0398", "\u0399", "\u039b", "\u039c", "\u039d", "\u039e", "\u039f", "\u03a0", "\u03a1", "\u03a3", "\u03a4", "\u03a9", "\u03ac", "\u03ad", "\u03ae", "\u03af", "\u03b1", "\u03b2", "\u03b3", "\u03b4", "\u03b5", "\u03b6", "\u03b7", "\u03b8", "\u03b9", "\u03ba", "\u03bb", "\u03bc", "\u03bd", "\u03be", "\u03bf", "\u03c0", "\u03c1", "\u03c2", "\u03c3", "\u03c4", "\u03c5", "\u03c6", "\u03c7", "\u03c9", "\u03ca", "\u03cc", "\u03cd", "\u03ce", "\u0410", "\u0411", "\u0412", "\u0413", "\u0414", "\u041a", "\u041b", "\u041c", "\u041e", "\u041f", "\u0420", "\u0421", "\u0422", "\u0423", "\u042d", "\u0430", "\u0432", "\u0433", "\u0434", "\u0435", "\u0437", "\u0438", "\u0439", "\u043a", "\u043b", "\u043c", "\u043d", "\u043e", "\u043f", "\u0440", "\u0441", "\u0442", "\u0443", "\u0445", "\u0446", "\u0448", "\u044b", "\u044c", "\u044e", "\u044f", "\u0485", "\u04dc", "\u0535", "\u0544", "\u0548", "\u054e", "\u0552", "\u0561", "\u0565", "\u0577", "\u0578", "\u057a", "\u057d", "\u057f", "\u0580", "\u0581", "\u0582", "\u0585", "\u0586", "\u0587", "\u05b0", "\u05b5", "\u05b6", "\u05b7", "\u05b8", "\u05b9", "\u05bc", "\u05c2", "\u05d0", "\u05d1", "\u05d2", "\u05d3", "\u05d4", "\u05d5", "\u05d7", "\u05d8", "\u05d9", "\u05da", "\u05dc", "\u05dd", "\u05de", "\u05df", "\u05e0", "\u05e1", "\u05e2", "\u05e4", "\u05e6", "\u05e7", "\u05e8", "\u05e9", "\u05ea", "\u0621", "\u0625", "\u0627", "\u0628", "\u0629", "\u062a", "\u062b", "\u062c", "\u062d", "\u062f", "\u0631", "\u0632", "\u0633", "\u0634", "\u0636", "\u0638", "\u0639", "\u0641", "\u0643", "\u0644", "\u0645", "\u0646", "\u0647", "\u0648", "\u0649", "\u064a", "\u064e", "\u064f", "\u0650", "\u0651", "\u0652", "\u0670", "\u0905", "\u0915", "\u091f", "\u0930", "\u0932", "\u093f", "\u0947", "\u094d", "\u0e0a", "\u0e21", "\u0e2d", "\u0e30", "\u1200", "\u1201", "\u1202", "\u1205", "\u1261", "\u12a0", "\u12f3", "\u130a", "\u1431", "\u1433", "\u1438", "\u144e", "\u1450", "\u1455", "\u16ed", "\u1e0d", "\u1e17", "\u1e24", "\u1e25", "\u1e2a", "\u1e2b", "\u1e32", "\u1e43", "\u1e45", "\u1e47", "\u1e49", "\u1e5b", "\u1e63", "\u1e6d", "\u1e6f", "\u1e92", "\u1e93", "\u1f00", "\u1f01", "\u1f04", "\u1f08", "\u1f0c", "\u1f20", "\u1f28", "\u1f30", "\u1f38", "\u1f39", "\u1f41", "\u1f70", "\u1f76", "\u1f78", "\u1fb0", "\u1fb1", "\u1fb6", "\u1fb8", "\u1fb9", "\u1fc6", "\u1fd6", "\u1fe6", "\u1ff6", "\u1ff7", "\u2010", "\u2011", "\u2013", "\u2014", "\u2015", "\u2018", "\u2019", "\u201b", "\u201c", "\u201d", "\u2020", "\u2022", "\u2024", "\u2026", "\u2030", "\u2032", "\u2033", "\u20a3", "\u20a4", "\u20ac", "\u2102", "\u210d", "\u2115", "\u211d", "\u2190", "\u2191", "\u2192", "\u2193", "\u2194", "\u21cc", "\u2206", "\u2208", "\u2212", "\u2217", "\u221d", "\u2227", "\u2228", "\u223c", "\u2248", "\u2260", "\u2261", "\u2264", "\u2265", "\u227c", "\u227d", "\u2282", "\u22a5", "\u2308", "\u230a", "\u23a7", "\u23a9", "\u23e8", "\u2423", "\u2460", "\u2464", "\u2500", "\u250c", "\u2510", "\u2565", "\u2568", "\u2580", "\u2584", "\u2588", "\u2591", "\u2592", "\u2593", "\u25a1", "\u25cb", "\u25d8", "\u262b", "\u263a", "\u2648", "\u2665", "\u2c77", "\u2c8f", "\u2c99", "\u2ca5", "\u2ca7", "\u304b", "\u304d", "\u304f", "\u3051", "\u3053", "\u3061", "\u3068", "\u3083", "\u3089", "\u308a", "\u308b", "\u308c", "\u308d", "\u3093", "\u30a2", "\u30a3", "\u30a7", "\u30b7", "\u30b8", "\u30cc", "\u30e5", "\u30eb", "\u30ef", "\u310c", "\u3122", "\u3128", "\u4e09", "\u4e39", "\u4eba", "\u5143", "\u516c", "\u57e0", "\u58eb", "\u5927", "\u5929", "\u592b", "\u5937", "\u59cb", "\u5a41", "\u5b66", "\u5b89", "\u5bcc", "\u5c71", "\u5de6", "\u5e1d", "\u5eb7", "\u5f97", "\u62c9", "\u65e5", "\u664f", "\u66f4", "\u672c", "\u6821", "\u695a", "\u6cd5", "\u71d5", "\u7687", "\u76db", "\u76e4", "\u79e6", "\u7b97", "\u80c3", "\u8272", "\u83ef", "\u86ee", "\u8766", "\u883b", "\u897f", "\u8d99", "\u9640", "\u9670", "\u97d3", "\u9b4f", "\u9f4a", "\uc0b0", "\uc218", "\uc8fc", "\ud310", "\uff08", "\uff09", "\ud804\udc05", "\ud804\udc13", "\ud804\udc32", "\ud804\udc44", "<UNK>"], "dict": {"<PAD>": 0, " ": 1, "!": 2, "\"": 3, "#": 4, "$": 5, "%": 6, "&": 7, "'": 8, "(": 9, ")": 10, "*": 11, "+": 12, ",": 13, "-": 14, ".": 15, "/": 16, "0": 17, "1": 18, "2": 19, "3": 20, "4": 21, "5": 22, "6": 23, "7": 24, "8": 25, "9": 26, ":": 27, ";": 28, "<": 29, "=": 30, ">": 31, "?": 32, "@": 33, "A": 34, "B": 35, "C": 36, "D": 37, "E": 38, "F": 39, "G": 40, "H": 41, "I": 42, "J": 43, "K": 44, "L": 45, "M": 46, "N": 47, "O": 48, "P": 49, "Q": 50, "R": 51, "S": 52, "T": 53, "U": 54, "V": 55, "W": 56, "X": 57, "Y": 58, "Z": 59, "[": 60, "\\": 61, "]": 62, "^": 63, "_": 64, "`": 65, "a": 66, "b": 67, "c": 68, "d": 69, "e": 70, "f": 71, "g": 72, "h": 73, "i": 74, "j": 75, "k": 76, "l": 77, "m": 78, "n": 79, "o": 80, "p": 81, "q": 82, "r": 83, "s": 84, "t": 85, "u": 86, "v": 87, "w": 88, "x": 89, "y": 90, "z": 91, "{": 92, "}": 93, "~": 94, "\u00a2": 95, "\u00a3": 96, "\u00a5": 97, "\u00a7": 98, "\u00ab": 99, "\u00ac": 100, "\u00af": 101, "\u00b0": 102, "\u00b1": 103, "\u00b2": 104, "\u00b3": 105, "\u00b5": 106, "\u00b7": 107, "\u00bb": 108, "\u00bd": 109, "\u00c0": 110, "\u00c1": 111, "\u00c4": 112, "\u00c5": 113, "\u00c6": 114, "\u00c7": 115, "\u00c9": 116, "\u00ce": 117, "\u00d1": 118, "\u00d2": 119, "\u00d3": 120, "\u00d6": 121, "\u00d7": 122, "\u00d8": 123, "\u00dc": 124, "\u00dd": 125, "\u00de": 126, "\u00df": 127, "\u00e0": 128, "\u00e1": 129, "\u00e2": 130, "\u00e3": 131, "\u00e4": 132, "\u00e5": 133, "\u00e6": 134, "\u00e7": 135, "\u00e8": 136, "\u00e9": 137, "\u00ea": 138, "\u00eb": 139, "\u00ec": 140, "\u00ed": 141, "\u00ee": 142, "\u00ef": 143, "\u00f0": 144, "\u00f1": 145, "\u00f2": 146, "\u00f3": 147, "\u00f4": 148, "\u00f5": 149, "\u00f6": 150, "\u00f7": 151, "\u00f8": 152, "\u00f9": 153, "\u00fa": 154, "\u00fb": 155, "\u00fc": 156, "\u00fd": 157, "\u00fe": 158, "\u00ff": 159, "\u0100": 160, "\u0101": 161, "\u0103": 162, "\u0106": 163, "\u0107": 164, "\u010c": 165, "\u010d": 166, "\u0110": 167, "\u0111": 168, "\u0113": 169, "\u0114": 170, "\u0115": 171, "\u011b": 172, "\u011f": 173, "\u0126": 174, "\u0127": 175, "\u012b": 176, "\u012d": 177, "\u0130": 178, "\u0131": 179, "\u0142": 180, "\u0144": 181, "\u014b": 182, "\u014c": 183, "\u014d": 184, "\u0152": 185, "\u0153": 186, "\u0159": 187, "\u015a": 188, "\u015b": 189, "\u015e": 190, "\u015f": 191, "\u0160": 192, "\u0161": 193, "\u016b": 194, "\u0177": 195, "\u017e": 196, "\u01b7": 197, "\u01b8": 198, "\u01d4": 199, "\u0219": 200, "\u021a": 201, "\u0222": 202, "\u0250": 203, "\u0251": 204, "\u0259": 205, "\u025b": 206, "\u025f": 207, "\u0263": 208, "\u028e": 209, "\u0294": 210, "\u02b7": 211, "\u02b9": 212, "\u02bb": 213, "\u02bc": 214, "\u02be": 215, "\u02bf": 216, "\u02c8": 217, "\u02d0": 218, "\u0301": 219, "\u0304": 220, "\u0321": 221, "\u0325": 222, "\u0328": 223, "\u0331": 224, "\u0335": 225, "\u033d": 226, "\u0388": 227, "\u0390": 228, "\u0391": 229, "\u0392": 230, "\u0394": 231, "\u0395": 232, "\u0397": 233, "\u0398": 234, "\u0399": 235, "\u039b": 236, "\u039c": 237, "\u039d": 238, "\u039e": 239, "\u039f": 240, "\u03a0": 241, "\u03a1": 242, "\u03a3": 243, "\u03a4": 244, "\u03a9": 245, "\u03ac": 246, "\u03ad": 247, "\u03ae": 248, "\u03af": 249, "\u03b1": 250, "\u03b2": 251, "\u03b3": 252, "\u03b4": 253, "\u03b5": 254, "\u03b6": 255, "\u03b7": 256, "\u03b8": 257, "\u03b9": 258, "\u03ba": 259, "\u03bb": 260, "\u03bc": 261, "\u03bd": 262, "\u03be": 263, "\u03bf": 264, "\u03c0": 265, "\u03c1": 266, "\u03c2": 267, "\u03c3": 268, "\u03c4": 269, "\u03c5": 270, "\u03c6": 271, "\u03c7": 272, "\u03c9": 273, "\u03ca": 274, "\u03cc": 275, "\u03cd": 276, "\u03ce": 277, "\u0410": 278, "\u0411": 279, "\u0412": 280, "\u0413": 281, "\u0414": 282, "\u041a": 283, "\u041b": 284, "\u041c": 285, "\u041e": 286, "\u041f": 287, "\u0420": 288, "\u0421": 289, "\u0422": 290, "\u0423": 291, "\u042d": 292, "\u0430": 293, "\u0432": 294, "\u0433": 295, "\u0434": 296, "\u0435": 297, "\u0437": 298, "\u0438": 299, "\u0439": 300, "\u043a": 301, "\u043b": 302, "\u043c": 303, "\u043d": 304, "\u043e": 305, "\u043f": 306, "\u0440": 307, "\u0441": 308, "\u0442": 309, "\u0443": 310, "\u0445": 311, "\u0446": 312, "\u0448": 313, "\u044b": 314, "\u044c": 315, "\u044e": 316, "\u044f": 317, "\u0485": 318, "\u04dc": 319, "\u0535": 320, "\u0544": 321, "\u0548": 322, "\u054e": 323, "\u0552": 324, "\u0561": 325, "\u0565": 326, "\u0577": 327, "\u0578": 328, "\u057a": 329, "\u057d": 330, "\u057f": 331, "\u0580": 332, "\u0581": 333, "\u0582": 334, "\u0585": 335, "\u0586": 336, "\u0587": 337, "\u05b0": 338, "\u05b5": 339, "\u05b6": 340, "\u05b7": 341, "\u05b8": 342, "\u05b9": 343, "\u05bc": 344, "\u05c2": 345, "\u05d0": 346, "\u05d1": 347, "\u05d2": 348, "\u05d3": 349, "\u05d4": 350, "\u05d5": 351, "\u05d7": 352, "\u05d8": 353, "\u05d9": 354, "\u05da": 355, "\u05dc": 356, "\u05dd": 357, "\u05de": 358, "\u05df": 359, "\u05e0": 360, "\u05e1": 361, "\u05e2": 362, "\u05e4": 363, "\u05e6": 364, "\u05e7": 365, "\u05e8": 366, "\u05e9": 367, "\u05ea": 368, "\u0621": 369, "\u0625": 370, "\u0627": 371, "\u0628": 372, "\u0629": 373, "\u062a": 374, "\u062b": 375, "\u062c": 376, "\u062d": 377, "\u062f": 378, "\u0631": 379, "\u0632": 380, "\u0633": 381, "\u0634": 382, "\u0636": 383, "\u0638": 384, "\u0639": 385, "\u0641": 386, "\u0643": 387, "\u0644": 388, "\u0645": 389, "\u0646": 390, "\u0647": 391, "\u0648": 392, "\u0649": 393, "\u064a": 394, "\u064e": 395, "\u064f": 396, "\u0650": 397, "\u0651": 398, "\u0652": 399, "\u0670": 400, "\u0905": 401, "\u0915": 402, "\u091f": 403, "\u0930": 404, "\u0932": 405, "\u093f": 406, "\u0947": 407, "\u094d": 408, "\u0e0a": 409, "\u0e21": 410, "\u0e2d": 411, "\u0e30": 412, "\u1200": 413, "\u1201": 414, "\u1202": 415, "\u1205": 416, "\u1261": 417, "\u12a0": 418, "\u12f3": 419, "\u130a": 420, "\u1431": 421, "\u1433": 422, "\u1438": 423, "\u144e": 424, "\u1450": 425, "\u1455": 426, "\u16ed": 427, "\u1e0d": 428, "\u1e17": 429, "\u1e24": 430, "\u1e25": 431, "\u1e2a": 432, "\u1e2b": 433, "\u1e32": 434, "\u1e43": 435, "\u1e45": 436, "\u1e47": 437, "\u1e49": 438, "\u1e5b": 439, "\u1e63": 440, "\u1e6d": 441, "\u1e6f": 442, "\u1e92": 443, "\u1e93": 444, "\u1f00": 445, "\u1f01": 446, "\u1f04": 447, "\u1f08": 448, "\u1f0c": 449, "\u1f20": 450, "\u1f28": 451, "\u1f30": 452, "\u1f38": 453, "\u1f39": 454, "\u1f41": 455, "\u1f70": 456, "\u1f76": 457, "\u1f78": 458, "\u1fb0": 459, "\u1fb1": 460, "\u1fb6": 461, "\u1fb8": 462, "\u1fb9": 463, "\u1fc6": 464, "\u1fd6": 465, "\u1fe6": 466, "\u1ff6": 467, "\u1ff7": 468, "\u2010": 469, "\u2011": 470, "\u2013": 471, "\u2014": 472, "\u2015": 473, "\u2018": 474, "\u2019": 475, "\u201b": 476, "\u201c": 477, "\u201d": 478, "\u2020": 479, "\u2022": 480, "\u2024": 481, "\u2026": 482, "\u2030": 483, "\u2032": 484, "\u2033": 485, "\u20a3": 486, "\u20a4": 487, "\u20ac": 488, "\u2102": 489, "\u210d": 490, "\u2115": 491, "\u211d": 492, "\u2190": 493, "\u2191": 494, "\u2192": 495, "\u2193": 496, "\u2194": 497, "\u21cc": 498, "\u2206": 499, "\u2208": 500, "\u2212": 501, "\u2217": 502, "\u221d": 503, "\u2227": 504, "\u2228": 505, "\u223c": 506, "\u2248": 507, "\u2260": 508, "\u2261": 509, "\u2264": 510, "\u2265": 511, "\u227c": 512, "\u227d": 513, "\u2282": 514, "\u22a5": 515, "\u2308": 516, "\u230a": 517, "\u23a7": 518, "\u23a9": 519, "\u23e8": 520, "\u2423": 521, "\u2460": 522, "\u2464": 523, "\u2500": 524, "\u250c": 525, "\u2510": 526, "\u2565": 527, "\u2568": 528, "\u2580": 529, "\u2584": 530, "\u2588": 531, "\u2591": 532, "\u2592": 533, "\u2593": 534, "\u25a1": 535, "\u25cb": 536, "\u25d8": 537, "\u262b": 538, "\u263a": 539, "\u2648": 540, "\u2665": 541, "\u2c77": 542, "\u2c8f": 543, "\u2c99": 544, "\u2ca5": 545, "\u2ca7": 546, "\u304b": 547, "\u304d": 548, "\u304f": 549, "\u3051": 550, "\u3053": 551, "\u3061": 552, "\u3068": 553, "\u3083": 554, "\u3089": 555, "\u308a": 556, "\u308b": 557, "\u308c": 558, "\u308d": 559, "\u3093": 560, "\u30a2": 561, "\u30a3": 562, "\u30a7": 563, "\u30b7": 564, "\u30b8": 565, "\u30cc": 566, "\u30e5": 567, "\u30eb": 568, "\u30ef": 569, "\u310c": 570, "\u3122": 571, "\u3128": 572, "\u4e09": 573, "\u4e39": 574, "\u4eba": 575, "\u5143": 576, "\u516c": 577, "\u57e0": 578, "\u58eb": 579, "\u5927": 580, "\u5929": 581, "\u592b": 582, "\u5937": 583, "\u59cb": 584, "\u5a41": 585, "\u5b66": 586, "\u5b89": 587, "\u5bcc": 588, "\u5c71": 589, "\u5de6": 590, "\u5e1d": 591, "\u5eb7": 592, "\u5f97": 593, "\u62c9": 594, "\u65e5": 595, "\u664f": 596, "\u66f4": 597, "\u672c": 598, "\u6821": 599, "\u695a": 600, "\u6cd5": 601, "\u71d5": 602, "\u7687": 603, "\u76db": 604, "\u76e4": 605, "\u79e6": 606, "\u7b97": 607, "\u80c3": 608, "\u8272": 609, "\u83ef": 610, "\u86ee": 611, "\u8766": 612, "\u883b": 613, "\u897f": 614, "\u8d99": 615, "\u9640": 616, "\u9670": 617, "\u97d3": 618, "\u9b4f": 619, "\u9f4a": 620, "\uc0b0": 621, "\uc218": 622, "\uc8fc": 623, "\ud310": 624, "\uff08": 625, "\uff09": 626, "\ud804\udc05": 627, "\ud804\udc13": 628, "\ud804\udc32": 629, "\ud804\udc44": 630, "<UNK>": 631}}